app/controllers/doors_controller.rb

SELECT  "doors".* FROM "doors"  ORDER BY "doors"."id" ASC LIMIT 1
---
	def index
		@doors = Door.all

UPDATE "doors" SET "status" = ?, "updated_at" = ? WHERE "doors"."id" = ?  [["status", "t"], ["updated_at", "2016-04-09 23:12:11.606374"], ["id", 1]]
---
	def open_door
		# Get the status and just do the opposite action, it should go to true.
		@door.status = true
		# Save the new status
		@door.save!

UPDATE "doors" SET "status" = ?, "updated_at" = ? WHERE "doors"."id" = ?  [["status", "f"], ["updated_at", "2016-04-09 23:12:17.637682"], ["id", 1]]
---
	def close_door
		# Close the door.
		@door.status = false
		# Save the state
		@door.save!

SELECT  "doors".* FROM "doors"  ORDER BY "doors"."id" ASC LIMIT 1
---
	def set_door
		@door = Door.first